tutorials/multiRegionTwoPhaseStratifiedShearFlow/constant/regionInterfaceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      regionInterfaceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regionInterfaceType fluidFluid;

fluidABottomFluidBTop
{
    sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.07;
}

// ************************************************************************* //
