tutorials/multiRegionTwoPhaseStratifiedShearFlow/system/fluidA/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver              GAMG;
        tolerance           1e-7;
        relTol              0;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator    	faceAreaPair;
        mergeLevels     	1;
        minIter         	2;
        maxIter         	50;
    };

/*    T*/
/*    {*/
/*        solver          PBiCG;*/
/*        preconditioner  diagonal;*/
/*        tolerance       1e-15;*/
/*        relTol          1e-2;*/
/*        minIter         2;*/
/*        maxIter         50;*/
/*    };*/

    Tcoupled
    {
        solver           BiCGStab;
        
        preconditioner      
        {                   
            preconditioner  Cholesky;
        }

        tolerance        1e-15;
        relTol           0;

        minIter          0;
        maxIter          200;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;

    residualControl
    {
        T               1e-4;
    }
}

relaxationFactors
{
	T	1.0;
}



// ************************************************************************* //
