tutorials/multiRegionTwoPhaseStratifiedShearFlow/system/fluidB/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ddtSchemes
{
}

d2dt2Schemes
{
}

interpolationSchemes
{
}

divSchemes
{
}

gradSchemes
{
}

lnGradSchemes
{
}

laplacianSchemes
{
}

fluxRequired
{
}


// ************************************************************************* //
